_posts/todo.html


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Твиты </h2>
<div class="outline-text-2" id="text-1">

<p>После пары лет использования Эмакса вполне нормально забыть все его комбинации. Вы же не помните как дышать, правда?
Магические методы _<sub>init</sub>__ и _<sub>new</sub>__ носят особый, уличный
характер&hellip; IMB Py Metaclass link
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Статьи </h2>
<div class="outline-text-2" id="text-2">


<p>
Seibel: Which is sort of ironic given the way the commands move out of
your brain and into your fingers. I’m sure you have experienced the
phenomenon of having someone ask you what is the key-binding for
something that you use a thousand times a day, and you can’t say.
</p>
<p>
Steele: Actually my wife had that experience. Maybe one of the reasons I
was less aware of it is that I’m not a particularly good touch typist. But she’d
been away from Emacs for 20 years and then I made one available on her
Macintosh. And she sat down, typed in some stuff, and then said, “How do I
save this? I forget how to save a file.” And then she realized her fingers had
done it and she didn’t know what she’d typed. So she did it again and
watched her fingers and said, “Oh yes, Control-X Control-S.” But she
literally couldn’t remember what the commands were.
</p>
<p>
Idea: indeterministic protocol.
etherpad
realtime
</p></div>
</div>
